# St7SetBeamRoundFacets

Sets the number of circumferential facets used to render circular beam sections and spring elements.

long St7SetBeamRoundFacets(long uID, long Facets)
Input Parameters
uID
Strand7 model file ID.
Facets
The number of facets around one revolution in the range kMinFacets to kMaxFacets.